openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103_can.h
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32l103_can.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2023/07/08
 * Description        : This file contains all the functions prototypes for the
 *                      CAN firmware library.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#ifndef __CH32L103_CAN_H
#define __CH32L103_CAN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "ch32l103.h"

/* CAN init structure definition */
typedef struct
{
    uint16_t CAN_Prescaler; /* Specifies the length of a time quantum.
                               It ranges from 1 to 1024. */

    uint8_t CAN_Mode; /* Specifies the CAN operating mode.
                         This parameter can be a value of
                        @ref CAN_operating_mode */

    uint8_t CAN_SJW; /* Specifies the maximum number of time quanta
                        the CAN hardware is allowed to lengthen or
                        shorten a bit to perform resynchronization.
                        This parameter can be a value of
                        @ref CAN_synchronisation_jump_width */

    uint8_t CAN_BS1; /* Specifies the number of time quanta in Bit
                        Segment 1. This parameter can be a value of
                        @ref CAN_time_quantum_in_bit_segment_1 */

    uint8_t CAN_BS2; /* Specifies the number of time quanta in Bit
                        Segment 2.
                        This parameter can be a value of
                        @ref CAN_time_quantum_in_bit_segment_2 */

    FunctionalState CAN_TTCM; /* Enable or disable the time triggered
                                 communication mode. This parameter can be set
                                 either to ENABLE or DISABLE. */

    FunctionalState CAN_ABOM; /* Enable or disable the automatic bus-off
                                 management. This parameter can be set either
                                 to ENABLE or DISABLE. */

    FunctionalState CAN_AWUM; /* Enable or disable the automatic wake-up mode.
                                 This parameter can be set either to ENABLE or
                                 DISABLE. */

    FunctionalState CAN_NART; /* Enable or disable the no-automatic
                                 retransmission mode. This parameter can be
                                 set either to ENABLE or DISABLE. */

    FunctionalState CAN_RFLM; /* Enable or disable the Receive FIFO Locked mode.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CAN_TXFP; /* Enable or disable the transmit FIFO priority.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */
} CAN_InitTypeDef;

/* CAN filter init structure definition */
typedef struct
{
    uint16_t CAN_FilterIdHigh; /* Specifies the filter identification number (MSBs for a 32-bit
                                      configuration, first one for a 16-bit configuration).
                                      This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterIdLow; /* Specifies the filter identification number (LSBs for a 32-bit
                                     configuration, second one for a 16-bit configuration).
                                     This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterMaskIdHigh; /* Specifies the filter mask number or identification number,
                                          according to the mode (MSBs for a 32-bit configuration,
                                          first one for a 16-bit configuration).
                                          This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterMaskIdLow; /* Specifies the filter mask number or identification number,
                                         according to the mode (LSBs for a 32-bit configuration,
                                         second one for a 16-bit configuration).
                                         This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterFIFOAssignment; /* Specifies the FIFO (0 or 1) which will be assigned to the filter.
                                              This parameter can be a value of @ref CAN_filter_FIFO */

    uint8_t CAN_FilterNumber; /* Specifies the filter which will be initialized. It ranges from 0 to 13. */

    uint8_t CAN_FilterMode; /* Specifies the filter mode to be initialized.
                                   This parameter can be a value of @ref CAN_filter_mode */

    uint8_t CAN_FilterScale; /* Specifies the filter scale.
                                    This parameter can be a value of @ref CAN_filter_scale */

    FunctionalState CAN_FilterActivation; /* Enable or disable the filter.
                                              This parameter can be set either to ENABLE or DISABLE. */
} CAN_FilterInitTypeDef;

/* CAN Tx message structure definition */
typedef struct
{
    uint32_t StdId; /* Specifies the standard identifier.
                       This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId; /* Specifies the extended identifier.
                       This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDE; /* Specifies the type of identifier for the message that
                    will be transmitted. This parameter can be a value
                    of @ref CAN_identifier_type */

    uint8_t RTR; /* Specifies the type of frame for the message that will
                    be transmitted. This parameter can be a value of
                    @ref CAN_remote_transmission_request */

    uint8_t DLC; /* Specifies the length of the frame that will be
                    transmitted. This parameter can be a value between
                    0 to 8 */

    uint8_t Data[8]; /* Contains the data to be transmitted. It ranges from 0
                         to 0xFF. */
} CanTxMsg;

