openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103_can.h
/* CAN Rx message structure definition  */
typedef struct
{
    uint32_t StdId; /* Specifies the standard identifier.
                       This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId; /* Specifies the extended identifier.
                       This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDE; /* Specifies the type of identifier for the message that
                    will be received. This parameter can be a value of
                    @ref CAN_identifier_type */

    uint8_t RTR; /* Specifies the type of frame for the received message.
                    This parameter can be a value of
                    @ref CAN_remote_transmission_request */

    uint8_t DLC; /* Specifies the length of the frame that will be received.
                    This parameter can be a value between 0 to 8 */

    uint8_t Data[8]; /* Contains the data to be received. It ranges from 0 to
                        0xFF. */

    uint8_t FMI; /* Specifies the index of the filter the message stored in
                    the mailbox passes through. This parameter can be a
                    value between 0 to 0xFF */
} CanRxMsg;

/* CANFD init structure definition */
typedef struct
{
    uint16_t CANFD_Prescaler; /* Specifies the length of a time quantum.
                               It ranges from 1 to 32. */

    uint8_t CANFD_Mode; /* Specifies the CAN operating mode.
                         This parameter can be a value of
                        @ref CAN_operating_mode */

    uint8_t CANFD_SJW; /* Specifies the maximum number of time quanta
                        the CAN hardware is allowed to lengthen or
                        shorten a bit to perform resynchronization.
                        This parameter can be a value of
                        @ref CANFD_synchronisation_jump_width */

    uint8_t CANFD_BS1; /* Specifies the number of time quanta in Bit
                        Segment 1. This parameter can be a value of
                        @ref CANFD_time_quantum_in_bit_segment_1 */

    uint8_t CANFD_BS2; /* Specifies the number of time quanta in Bit
                        Segment 2.
                        This parameter can be a value of
                        @ref CANFD_time_quantum_in_bit_segment_2 */

    uint8_t CANFD_TDC_FILTER; /* Specifies the number of time quanta in Bit Segment
                               Minimum delay of internal delay counter.
                               It ranges from 0 to 63. */

    uint8_t CANFD_TDC0; /* Specifies the number of time quanta in Bit Segment
                         transmission delay compensation offset.
                         It ranges from 0 to 63. */

    FunctionalState CANFD_TDCE; /* Enable or disable transmission delay compensation offset.
                                 This parameter can be set either to ENABLE or DISABLE. */

    FunctionalState CANFD_TTCM; /* Enable or disable the time triggered
                                 communication mode. This parameter can be set
                                 either to ENABLE or DISABLE. */

    FunctionalState CANFD_ABOM; /* Enable or disable the automatic bus-off
                                 management. This parameter can be set either
                                 to ENABLE or DISABLE. */

    FunctionalState CANFD_AWUM; /* Enable or disable the automatic wake-up mode.
                                 This parameter can be set either to ENABLE or
                                 DISABLE. */

    FunctionalState CANFD_NART; /* Enable or disable the no-automatic
                                 retransmission mode. This parameter can be
                                 set either to ENABLE or DISABLE. */

    FunctionalState CANFD_TXFP; /* Enable or disable the transmit FIFO priority.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_RES_Error; /* Enable or disable the RES bit can generate error .
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_ESI_Auto_TXM0; /* Enable or disable the ESI bit auto mode for Tx mailbox 0.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_ESI_Auto_TXM1; /* Enable or disable the ESI bit auto mode for Tx mailbox 1.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_ESI_Auto_TXM2; /* Enable or disable the ESI bit auto mode for Tx mailbox 2.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_BRS_TXM0; /* Enable or disable the BRS bit speed switch for Tx mailbox 0.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_BRS_TXM1; /* Enable or disable the BRS bit speed switch for Tx mailbox 1.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */

    FunctionalState CANFD_BRS_TXM2; /* Enable or disable the BRS bit speed switch for Tx mailbox 2.
                                 This parameter can be set either to ENABLE
                                 or DISABLE. */
} CANFD_InitTypeDef;

/* CANFD Tx message structure definition */
typedef struct
{
    uint32_t StdId; /* Specifies the standard identifier.
                       This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId; /* Specifies the extended identifier.
                       This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t Data[64]; /* Contains the data to be transmitted. It ranges from 0
                         to 0xFF. */

