openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103_can.h
/* CANFD_synchronisation_jump_width */
#define CANFD_SJW_1tq                          ((uint8_t)0x00) /* 1 time quantum */
#define CANFD_SJW_2tq                          ((uint8_t)0x01) /* 2 time quantum */
#define CANFD_SJW_3tq                          ((uint8_t)0x02) /* 3 time quantum */
#define CANFD_SJW_4tq                          ((uint8_t)0x03) /* 4 time quantum */
#define CANFD_SJW_5tq                          ((uint8_t)0x04) /* 5 time quantum */
#define CANFD_SJW_6tq                          ((uint8_t)0x05) /* 6 time quantum */
#define CANFD_SJW_7tq                          ((uint8_t)0x06) /* 7 time quantum */
#define CANFD_SJW_8tq                          ((uint8_t)0x07) /* 8 time quantum */
#define CANFD_SJW_9tq                          ((uint8_t)0x08) /* 9 time quantum */
#define CANFD_SJW_10tq                         ((uint8_t)0x09) /* 10 time quantum */
#define CANFD_SJW_11tq                         ((uint8_t)0x0A) /* 11 time quantum */
#define CANFD_SJW_12tq                         ((uint8_t)0x0B) /* 12 time quantum */
#define CANFD_SJW_13tq                         ((uint8_t)0x0C) /* 13 time quantum */
#define CANFD_SJW_14tq                         ((uint8_t)0x0D) /* 14 time quantum */
#define CANFD_SJW_15tq                         ((uint8_t)0x0E) /* 15 time quantum */
#define CANFD_SJW_16tq                         ((uint8_t)0x0F) /* 16 time quantum */

/* CANFD_time_quantum_in_bit_segment_1 */
#define CANFD_BS1_1tq                         ((uint8_t)0x00) /* 1 time quantum */
#define CANFD_BS1_2tq                         ((uint8_t)0x01) /* 2 time quantum */
#define CANFD_BS1_3tq                         ((uint8_t)0x02) /* 3 time quantum */
#define CANFD_BS1_4tq                         ((uint8_t)0x03) /* 4 time quantum */
#define CANFD_BS1_5tq                         ((uint8_t)0x04) /* 5 time quantum */
#define CANFD_BS1_6tq                         ((uint8_t)0x05) /* 6 time quantum */
#define CANFD_BS1_7tq                         ((uint8_t)0x06) /* 7 time quantum */
#define CANFD_BS1_8tq                         ((uint8_t)0x07) /* 8 time quantum */
#define CANFD_BS1_9tq                         ((uint8_t)0x08) /* 9 time quantum */
#define CANFD_BS1_10tq                        ((uint8_t)0x09) /* 10 time quantum */
#define CANFD_BS1_11tq                        ((uint8_t)0x0A) /* 11 time quantum */
#define CANFD_BS1_12tq                        ((uint8_t)0x0B) /* 12 time quantum */
#define CANFD_BS1_13tq                        ((uint8_t)0x0C) /* 13 time quantum */
#define CANFD_BS1_14tq                        ((uint8_t)0x0D) /* 14 time quantum */
#define CANFD_BS1_15tq                        ((uint8_t)0x0E) /* 15 time quantum */
#define CANFD_BS1_16tq                        ((uint8_t)0x0F) /* 16 time quantum */
#define CANFD_BS1_17tq                         ((uint8_t)0x10) /* 17 time quantum */
#define CANFD_BS1_18tq                         ((uint8_t)0x11) /* 18 time quantum */
#define CANFD_BS1_19tq                         ((uint8_t)0x12) /* 19 time quantum */
#define CANFD_BS1_20tq                         ((uint8_t)0x13) /* 20 time quantum */
#define CANFD_BS1_21tq                         ((uint8_t)0x14) /* 21 time quantum */
#define CANFD_BS1_22tq                         ((uint8_t)0x15) /* 22 time quantum */
#define CANFD_BS1_23tq                         ((uint8_t)0x16) /* 23 time quantum */
#define CANFD_BS1_24tq                         ((uint8_t)0x17) /* 24 time quantum */
#define CANFD_BS1_25tq                         ((uint8_t)0x18) /* 25 time quantum */
#define CANFD_BS1_26tq                         ((uint8_t)0x19) /* 26 time quantum */
#define CANFD_BS1_27tq                         ((uint8_t)0x1A) /* 27 time quantum */
#define CANFD_BS1_28tq                         ((uint8_t)0x1B) /* 28 time quantum */
#define CANFD_BS1_29tq                         ((uint8_t)0x1C) /* 29 time quantum */
#define CANFD_BS1_30tq                         ((uint8_t)0x1D) /* 30 time quantum */
#define CANFD_BS1_31tq                         ((uint8_t)0x1E) /* 31 time quantum */
#define CANFD_BS1_32tq                         ((uint8_t)0x1F) /* 32 time quantum */

/* CANFD_time_quantum_in_bit_segment_2 */
#define CANFD_BS2_1tq                          ((uint8_t)0x00) /* 1 time quantum */
#define CANFD_BS2_2tq                          ((uint8_t)0x01) /* 2 time quantum */
#define CANFD_BS2_3tq                          ((uint8_t)0x02) /* 3 time quantum */
#define CANFD_BS2_4tq                          ((uint8_t)0x03) /* 4 time quantum */
#define CANFD_BS2_5tq                          ((uint8_t)0x04) /* 5 time quantum */
#define CANFD_BS2_6tq                          ((uint8_t)0x05) /* 6 time quantum */
#define CANFD_BS2_7tq                          ((uint8_t)0x06) /* 7 time quantum */
#define CANFD_BS2_8tq                          ((uint8_t)0x07) /* 8 time quantum */
#define CANFD_BS2_9tq                          ((uint8_t)0x08) /* 9 time quantum */
#define CANFD_BS2_10tq                         ((uint8_t)0x09) /* 10 time quantum */
#define CANFD_BS2_11tq                         ((uint8_t)0x0A) /* 11 time quantum */
#define CANFD_BS2_12tq                         ((uint8_t)0x0B) /* 12 time quantum */
#define CANFD_BS2_13tq                         ((uint8_t)0x0C) /* 13 time quantum */
#define CANFD_BS2_14tq                         ((uint8_t)0x0D) /* 14 time quantum */
#define CANFD_BS2_15tq                         ((uint8_t)0x0E) /* 15 time quantum */
#define CANFD_BS2_16tq                         ((uint8_t)0x0F) /* 16 time quantum */

/* CAN_Transmit_Mailbox_number_constants */
#define CAN_Transmit_Mailbox0               ((uint8_t)0x00)
#define CAN_Transmit_Mailbox1               ((uint8_t)0x01)
#define CAN_Transmit_Mailbox2               ((uint8_t)0x02)


void        CAN_DeInit(CAN_TypeDef *CANx);
uint8_t     CAN_Init(CAN_TypeDef *CANx, CAN_InitTypeDef *CAN_InitStruct);
void        CAN_FilterInit(CAN_FilterInitTypeDef *CAN_FilterInitStruct);
void        CAN_StructInit(CAN_InitTypeDef *CAN_InitStruct);
void        CAN_SlaveStartBank(uint8_t CAN_BankNumber);
void        CAN_DBGFreeze(CAN_TypeDef *CANx, FunctionalState NewState);
void        CAN_TTComModeCmd(CAN_TypeDef *CANx, FunctionalState NewState);
uint8_t     CAN_Transmit(CAN_TypeDef *CANx, CanTxMsg *TxMessage);
uint8_t     CAN_TransmitStatus(CAN_TypeDef *CANx, uint8_t TransmitMailbox);
void        CAN_CancelTransmit(CAN_TypeDef *CANx, uint8_t Mailbox);
void        CAN_Receive(CAN_TypeDef *CANx, uint8_t FIFONumber, CanRxMsg *RxMessage);
void        CAN_FIFORelease(CAN_TypeDef *CANx, uint8_t FIFONumber);
uint8_t     CAN_MessagePending(CAN_TypeDef *CANx, uint8_t FIFONumber);
uint8_t     CAN_OperatingModeRequest(CAN_TypeDef *CANx, uint8_t CAN_OperatingMode);
uint8_t     CAN_Sleep(CAN_TypeDef *CANx);
uint8_t     CAN_WakeUp(CAN_TypeDef *CANx);
uint8_t     CAN_GetLastErrorCode(CAN_TypeDef *CANx);
uint8_t     CAN_GetReceiveErrorCounter(CAN_TypeDef *CANx);
uint8_t     CAN_GetLSBTransmitErrorCounter(CAN_TypeDef *CANx);
void        CAN_ITConfig(CAN_TypeDef *CANx, uint32_t CAN_IT, FunctionalState NewState);
FlagStatus  CAN_GetFlagStatus(CAN_TypeDef *CANx, uint32_t CAN_FLAG);
void        CAN_ClearFlag(CAN_TypeDef *CANx, uint32_t CAN_FLAG);
ITStatus    CAN_GetITStatus(CAN_TypeDef *CANx, uint32_t CAN_IT);
void        CAN_ClearITPendingBit(CAN_TypeDef *CANx, uint32_t CAN_IT);
void        CAN_BS1_ModeConfig(CAN_TypeDef* CANx, uint32_t CAN_BS1_Mode, uint8_t CAN_BS1_tq);
void        CAN_BusOff_ErrCntConfig(CAN_TypeDef *CANx, uint8_t BusOff_ErrCnt);
void        CANFD_Restrict_ModeCmd(CAN_TypeDef *CANx, FunctionalState NewState);
uint8_t     CANFD_Init(CAN_TypeDef *CANx, CANFD_InitTypeDef *CANFD_InitStruct);
void        CANFD_StructInit(CANFD_InitTypeDef *CANFD_InitStruct);
uint8_t     CANFD_Transmit(CAN_TypeDef *CANx, CanFDTxMsg *TxMessage);
ErrorStatus CANFD_Receive(CAN_TypeDef *CANx, uint8_t FIFONumber, CanFDRxMsg *RxMessage);
uint8_t     CANFD_GetTransmitDelayOffsetVal(CAN_TypeDef *CANx);
void        CANFD_TransmitMailbox_DMAAdr(CAN_TypeDef *CANx, uint8_t MailboxNumber, uint32_t Address);
void        CANFD_ReceiveFIFO_DMAAdr(CAN_TypeDef *CANx, uint8_t FIFONumber, uint32_t Address);


#ifdef __cplusplus
}
#endif

#endif
